{
    "app":
    {
        "title": "Les Contes <br> d'un Développeur",
        "nav":
        {
            "homeLink": "Accueil",
            "gameLink": "Jeux",
            "skillsLink": "Compétences",
            "associationsLink": "Associations"
        }
    },
    "homePage":
    {
        "title": "Chapitre 1 : Introduction",
        "p1": "Il était une fois un développeur à la recherche de nouvelles créations à faire naître de ses mains.<br>Peu lui importait la difficulté de ce qu'il devait programmer, il prenait grand plaisir à pourfendre les bugs.<br>Sous ses doigts agiles prenaient forme toute sorte d'application web.",
        "p2": "Il avait pu travailler pour d'autres dans la création d'application web. Bien qu'à ce jour il enseigne son métier à d'autres. Transmettant son savoir jour après jour à de futurs développeurs en soif d'apprendre.",
        "p3": "Sa curiosité rendait ses loisirs divers et varier, musique, lecture, jeux vidéos ou de sociétés, science et histoire ou encore artisanat, il trouvait toujours le temps trop court."
    },
    "skillsPage":
    {
        "title": "Chapitre 2 : Compétences",
        "p1": "Ce développeur avec enthousiasme apprenait à se servir de nouveaux outils. <br> Mais il savait que multiplier les outils sans fin n'avait que peu de sens. Il prenait donc grand soin de perfectionner et améliorer ses bon vieux outils.",
        "p2": "Il avait déjà de nombreuses cordes à son arc, entre autres choses, on pouvait citer :",
        "skills":
        {
            "default": "<h3>Compétences</h3> <p>Je vous prie de bien vouloir sélectionner une des compétences qui nous entoures.</p> ",
            "html": "<h3>HTML&nbsp;5</h3> <p>Base de toute application web, HTML cache derrière son apparente simplicité, une multitude de petits secrets. Sémantique et Accessibilité sont les maîtres mots de son HTML.</p>",
            "css": "<h3>CSS&nbsp;3</h3> <p>Si les mystères de l'art du design sont encore à atteindre, la reproduction de toute maquette est un défi à sa hauteur.</p>",
            "sass": "<h3>SASS&nbsp;-&nbsp;SCSS</h3> <p>Quand il découvrit SASS, le développeur compris qu'il pourrait se servir de cet outil pour gagner en temps et efficacité lors de ses aventures colorés.</p>",
            "js": "<h3>Javascript</h3> <p>Bien qu’appréciant HTML et CSS, ce qui lui plaît le plus est de se plonger dans les algorithmes, et la liberté qu'offre javascript lui permit de travailler ces derniers de maintes façons.</p>",
            "jquery": "<h3>JQuery</h3> <p>Cet amour de jeunesse ne fut jamais oublié bien que de nos jours il ne revient que rarement à sa rencontre.</p>",
            "ts": "<h3>Typescript</h3> <p>Souhaitant professionnaliser sa façon de travailler les algorithmes, mais les langages du net ne le permettant pas, il se tourna vers typescript pour un javascript plus stricte.</p>",
            "angular": "<h3>Angular</h3> <p>Parmi la mer de framework disponible pour javascript, son choix se tourna vers angular car il appréciait plus que tout les projets bien organisés en objet facile à lire.</p>",
            "mysql": "<h3>MySQL</h3> <p>Ce grand classique aux multiples possibilités tout aussi efficace pour de simples données que pour de complexes associations lui paru toujours plus parlant que les nombreuses autres possibilités.</p>",
            "php": "<h3>PHP</h3> <p>Il ne perdit jamais confiance en cet ancêtre des serveurs si souvent décrié. Suivant son évolution aux cours des ans, témoin de ses multiples corrections en faisant un langage toujours aussi moderne.</p>",
            "symfony": "<h3>Symfony</h3> <p>Créer back end solide était des plus simples mais souvent très répétitif, il se prit alors de passion pour Symfony lui permettant de raccourcir les moments les plus redondant pour se concentrer sur le coeur de ses applications web.</p>"
        }
    },
    "associationsPage":
    {
        "title": "Chapitre 3 : Associations",
        "p1": "Protagoniste de sa propre histoire, le développeur avait besoin parfois d'apparaître dans d'autres récits. <br> Il prit alors la décision de s'impliquer plus amplement dans la vie de deux associations qu'il fréquentait.",
        "t2": "Japon et Culture",
        "p2": "Cette association spécialisé dans l'enseignement de la langue japonaise et le partage de la culture de ce pays recherchait du soutien pour l'administration. Doué avec les chiffres, il entra au service de l'association en tant que vice trésorier.",
        "t3": "Les Irrécupérables du Jeu de Rôle",
        "p3": "Le président de cette association organisant soirées jeu de rôle, journées de Grandeur Nature et festivals entre autres choses se retrouvait souvent surchargé de travail. Le développeur se proposa comme bras droit pour le soutenir, en 2023 où il laissa la place à quelqu'un de vraiment intéressé par le rôle de vice président.<br> Il reste cependant chargé des relations et du placement des exposants lors des festivals."
    },
    "gamesPage":
    {
        "title": "Chapitre 4 : Jeux",
        "p1": "Petites créations ludiques développées par ses soins :",
        "games":
        {
            "labyrinth": "Le Labyrinthe",
            "ticTacToe": "Le tic tac toe",
            "fillLine": "Remplir les cases",
            "priceIsRight": "Le juste prix"
        }
    },
    "not-found":
    {
        "message": "Le temps à emporté cette page... 404."
    },
    "secret":
    {
        "merci":
        {
            "intro": "Bienvenue sur cette page, elle ne vous apprendra rien à mon sujet ou mes compétences. <br> Ici se trouve mes remerciements aux gens qui ont croisés plus ou moins longtemps mon chemin et qui l'on malheureusement définitivement quitté.",
            "g-mere": "Ma grand mère, Roseline FARGUES qui jouait avec moi pendant mon enfance.",
            "g-pere": "Mon grand père, Paul MARQUISET qui m'accueillait à ses côtés et dont j'aurais aimé connaître l'histoire.",
            "pere": "Mon père, Pierre-Yves MARQUISET qui m'a apprit nombres de choses durant ma vie et qui prenait le temps de s'intéresser à mes loisirs.",
            "oncle": "Mon oncle, Johnatan TROTIGNON qui m'a fait découvrir le développement et sans qui je ne serais pas là aujourd’hui.",
            "amis": 
            {
                "monique": "Monique MARECAUX toujours rayonnante dans les activités de l'association."
            }
        }
    }
}